
# Access dashDB and explore the data with Python

This notebook shows how to access a dashDB data warehouse or DB2 database when using Python. The examples use a dashDB warehouse, but the instructions apply to both dashDB and DB2.

<!--
![dashDB Logo](https://ibm.box.com/shared/static/42yt39czuksqdi278xpy96txtlw3lfmb.png)
![Python Logo](https://www.python.org/static/community_logos/python-logo-master-v3-TM-flattened.png)
-->

## Table of contents

1. [Setup](#Setup) 
1. [Import the *ibmdbpy* Python library](#Import-the-ibmdbpy-Python-library)
1. [Insert the database connection credentials](#Insert-the-database-connection-credentials)
1. [Create the database connection](#Create-the-database-connection)
1. [Use dataframe to read and manipulate tables](#Use-dataframe-to-read-and-manipulate-tables)
1. [Use SQL](#Use-SQL)
1. [Explore the trafficking data](#Explore-the-trafficking-data)
1. [Close the database connection](#Close-the-database-connection)
1. [Summary](#Summary)


## Setup

Before beginning you will need a *dashDB* instance. dashDB is a fully managed cloud data warehouse, purpose-built for analytics. It offers massively parallel processing (MPP) scale and compatibility with a wide range of business intelligence (BI) tools.  

1. __RIGHT-CLICK__ [this link](https://github.com/Davin-IBM/Proof-of-Technology/raw/master/DSX/Lab-1/data/Female-human-trafficking.csv) and select __Save Link As...__ to save the `Female-human-trafficking.csv` file to your desktop.
1. Download the [dashDB setup instructions](https://github.com/Davin-IBM/Proof-of-Technology/raw/master/DSX/Lab-1/dashDB-Setup.pdf).
1. Open up the PDF file that you've just downloaded in the previous step and follow the instructions there to setup dashDB, load the human trafficking data and create a DSX data connection.

<a class="ibm-tooltip" href="https://console.ng.bluemix.net/catalog/services/dashdb" target="_blank" title="" id="ibm-tooltip-0">
<img alt="IBM Bluemix.Get started now" height="193" width="153" src="https://ibm.box.com/shared/static/42yt39czuksqdi278xpy96txtlw3lfmb.png" >
</a>


## Import the *ibmdbpy* Python library

Python support for dashDB and DB2 is provided by the [ibmdbpy Python library](https://pypi.python.org/pypi/ibmdbpy). Connecting to dashDB or DB2 is also enabled by a DB2 driver, libdb2.so.  The ibmdbpy project provides a Python interface for data manipulation and access to in-database algorithms in IBM dashDB and IBM DB2. It accelerates Python analytics by seamlessly pushing operations written in Python into the underlying database for execution, thereby benefitting from in-database performance-enhancing features, such as columnar storage and parallel processing.

### Setup a *JDBC* connection
The JDBC Connection is based on a Java virtual machine. From the ibmdbpy library you can use JDBC to connect to a remote dashDB/DB2 instance. To be able to use JDBC to connect, we need to import the *JayDeBeApi* package and we need to add the dashDB/DB2 data connector jar file to the java class path.

To run a cell, click on the cell and click the run button in the toolbar or press __SHIFT-ENTER__.

Run the following commands to install and load the `JayDeBeApi` package and the `ibmdbpy` library into your notebook:

In [ ]:
#!pip install --trusted-host pypi.python.org JayDeBeApi==0.2.0 --user
#!pip install --trusted-host pypi.python.org --upgrade --user ibmdbpy

In [1]:
import jaydebeapi
from ibmdbpy import IdaDataBase
from ibmdbpy import IdaDataFrame

In [2]:
import os
os.environ['CLASSPATH'] = "/usr/local/src/data-connectors-1.4.1/db2jcc4-10.5.0.6.jar"

import jpype
args='-Djava.class.path=%s' % os.environ['CLASSPATH']
jvm = jpype.getDefaultJVMPath()
jpype.startJVM(jvm, args)


## Insert the database connection credentials

Click on the cell below, then on the notebook toolbar, click the box of 1's and 0's, find your database connection and click the __Insert to code__ link under the connection name to have a `credentials_1` dictionary added to the notebook.

__Note__: When this dictionary is inserted, it might have a different name than `credentials_1`.  If so change the dictionary name to `credentials_1` so that the rest of the notebook will work.

Connecting to dashDB requires the following information which are provided by the credentials dictionary inserted:
* Database name 
* Host DNS name or IP address 
* Host port
* Connection protocol
* User ID
* User password

The information `credentials_1` will be used to build a connection string in a subsequent step.

In [3]:
# The code was removed by DSX for sharing.

## Create the database connection

The following code snippet creates a connection string `connection_string`
and uses the `connection_string` to create a database connection object:

In [4]:
connection_string = 'jdbc:db2://{hostname}:{port}/{db}:user={username};password={password};'.format(**credentials_1)
idadb = IdaDataBase(dsn=connection_string)

## Use a dataframe to read and manipulate tables

You can now use the connection object `idadb` to query the database:

In [25]:
df = idadb.show_tables(show_all = True)
df.head(100)

    TABSCHEMA                     TABNAME      OWNER TYPE
0   DASH14135    FEMALE_HUMAN_TRAFFICKING  DASH14135    T
1     GOSALES                      BRANCH   DB2INST1    T
2     GOSALES             CONVERSION_RATE   DB2INST1    T
3     GOSALES                     COUNTRY   DB2INST1    T
4     GOSALES             CURRENCY_LOOKUP   DB2INST1    T
5     GOSALES             EURO_CONVERSION   DB2INST1    T
6     GOSALES            INVENTORY_LEVELS   DB2INST1    T
7     GOSALES               ORDER_DETAILS   DB2INST1    T
8     GOSALES                ORDER_HEADER   DB2INST1    T
9     GOSALES                ORDER_METHOD   DB2INST1    T
10    GOSALES                     PRODUCT   DB2INST1    T
11    GOSALES               PRODUCT_BRAND   DB2INST1    T
12    GOSALES        PRODUCT_COLOR_LOOKUP   DB2INST1    T
13    GOSALES            PRODUCT_FORECAST   DB2INST1    T
14    GOSALES                PRODUCT_LINE   DB2INST1    T
15    GOSALES         PRODUCT_NAME_LOOKUP   DB2INST1    T
16    GOSALES         PRODUCT_SIZE_LOOKUP   DB2INST1    T
17    GOSALES                PRODUCT_TYPE   DB2INST1    T
18    GOSALES               RETURNED_ITEM   DB2INST1    T
19    GOSALES               RETURN_REASON   DB2INST1    T
20    GOSALES                SALES_REGION   DB2INST1    T
21    GOSALES                SALES_TARGET   DB2INST1    T
22    GOSALES              TIME_DIMENSION   DB2INST1    T
23    GOSALES         TIME_QUARTER_LOOKUP   DB2INST1    T
24    GOSALES                      XGOREV   DB2INST1    T
25  GOSALESDW      AGGR_TIME_PROD_OM_FACT   DB2INST1    T
26  GOSALESDW                 BURST_TABLE   DB2INST1    T
27  GOSALESDW                BURST_TABLE2   DB2INST1    T
28  GOSALESDW         DIST_INVENTORY_FACT   DB2INST1    T
29  GOSALESDW  DIST_PRODUCT_FORECAST_FACT   DB2INST1    T
..        ...                         ...        ...  ...
70  GOSALESDW     MRK_ACTIVITY_STATUS_DIM   DB2INST1    T
71  GOSALESDW                MRK_ADV_FACT   DB2INST1    T
72  GOSALESDW     MRK_BUNDLE_GROUP_LOOKUP   DB2INST1    T
73  GOSALESDW         MRK_CAMPAIGN_LOOKUP   DB2INST1    T
74  GOSALESDW      MRK_PRODUCT_SURVEY_DIM   DB2INST1    T
75  GOSALESDW     MRK_PRODUCT_SURVEY_FACT   DB2INST1    T
76  GOSALESDW   MRK_PROD_SURVEY_TARG_FACT   DB2INST1    T
77  GOSALESDW           MRK_PROMOTION_DIM   DB2INST1    T
78  GOSALESDW          MRK_PROMOTION_FACT   DB2INST1    T
79  GOSALESDW     MRK_PROMOTION_PLAN_FACT   DB2INST1    T
80  GOSALESDW          MRK_RTL_SURVEY_DIM   DB2INST1    T
81  GOSALESDW         MRK_RTL_SURVEY_FACT   DB2INST1    T
82  GOSALESDW    MRK_RTL_SURVEY_TARG_FACT   DB2INST1    T
83  GOSALESDW        SLS_ORDER_METHOD_DIM   DB2INST1    T
84  GOSALESDW    SLS_PRODUCT_BRAND_LOOKUP   DB2INST1    T
85  GOSALESDW    SLS_PRODUCT_COLOR_LOOKUP   DB2INST1    T
86  GOSALESDW             SLS_PRODUCT_DIM   DB2INST1    T
87  GOSALESDW     SLS_PRODUCT_LINE_LOOKUP   DB2INST1    T
88  GOSALESDW          SLS_PRODUCT_LOOKUP   DB2INST1    T
89  GOSALESDW     SLS_PRODUCT_SIZE_LOOKUP   DB2INST1    T
90  GOSALESDW     SLS_PRODUCT_TYPE_LOOKUP   DB2INST1    T
91  GOSALESDW                 SLS_RTL_DIM   DB2INST1    T
92  GOSALESDW              SLS_SALES_FACT   DB2INST1    T
93  GOSALESDW         SLS_SALES_ORDER_DIM   DB2INST1    T
94  GOSALESDW         SLS_SALES_TARG_FACT   DB2INST1    T
95  GOSALESDW            VIEW_ACCOUNT_DIM   DB2INST1    V
96  GOSALESDW       VIEW_BALANCED_ORG_DIM   DB2INST1    V
97  GOSALESDW                VIEW_ORG_DIM   DB2INST1    V
98  GOSALESDW           VIEW_PRODUCT_NAME   DB2INST1    V
99  GOSALESDW         VIEW_STATEMENT_FACT   DB2INST1    V

[100 rows x 4 columns]

In [6]:
idadb.exists_table_or_view('GOSALESDW.EMP_EXPENSE_FACT')

True

Using our previously opened IdaDataBase instance named ‘idadb’, we can open one or several IdaDataFrame objects. They behave like pointers to remote tables.

Let us open the *EMP_EXPENSE_FACT* data set, assuming it is stored in the database under the name ‘GOSALESDW.EMP_EXPENSE_FACT’. The following cell assigns the dataset to a pandas DataFrame.

The [Pandas data analysis library](http://pandas.pydata.org/) provides high-performance, easy-to-use data structures and data analysis tools for the Python programming language. Pandas allows easy processing and manipulation of tabular data, so it is a perfect fit for data extracted from relational databases.

In [7]:
idadf = IdaDataFrame(idadb, 'GOSALESDW.EMP_EXPENSE_FACT')
idadf.dtypes

                      TYPENAME
DAY_KEY                INTEGER
ORGANIZATION_KEY       INTEGER
POSITION_KEY           INTEGER
EMPLOYEE_KEY           INTEGER
EXPENSE_TYPE_KEY       INTEGER
ACCOUNT_KEY            INTEGER
EXPENSE_UNIT_QUANTITY   DOUBLE
EXPENSE_TOTAL          DECIMAL

You can very easily explore the data in the IdaDataFrame by using built in functions.

Use IdaDataFrame.head to get the first n records of your data set (default 5):

In [8]:
idadf.head()

,DAY_KEY,ORGANIZATION_KEY,POSITION_KEY,EMPLOYEE_KEY,EXPENSE_TYPE_KEY,ACCOUNT_KEY,EXPENSE_UNIT_QUANTITY,EXPENSE_TOTAL
0,20100131,11188,43610,4898,2131,8049,150.00,5635.20
1,20100131,11188,43610,4898,2104,8050,15.00,563.52
2,20100131,11188,43610,4898,2120,8052,0.08,495.90
3,20100131,11188,43610,4898,2122,8054,0.11,681.86
4,20100131,11188,43610,4898,2124,8056,0.03,185.96

Use IdaDataFrame.tail to get the last n records of your data set (default 5):

In [9]:
idadf.tail(10)

,DAY_KEY,ORGANIZATION_KEY,POSITION_KEY,EMPLOYEE_KEY,EXPENSE_TYPE_KEY,ACCOUNT_KEY,EXPENSE_UNIT_QUANTITY,EXPENSE_TOTAL
127974,20130731,11108,43638,4272,2130,8050,0.005,6035.60
127975,20130731,11108,43638,4272,2131,8049,150.000,3379.95
127976,20130731,11203,43630,4273,2101,8049,165.000,2047.69
127977,20130731,11203,43630,4273,2120,8052,0.080,163.82
127978,20130731,11203,43630,4273,2122,8054,0.110,225.25
127979,20130731,11203,43630,4273,2124,8056,0.030,61.43
127980,20130731,11203,43630,4274,2101,8049,165.000,2047.69
127981,20130731,11203,43630,4274,2120,8052,0.080,163.82
127982,20130731,11203,43630,4274,2122,8054,0.110,225.25
127983,20130731,11203,43630,4274,2124,8056,0.030,61.43

__Note__: Because dashDB operates on a distributed system, the order of rows using IdaDataFrame.head and IdaDataFrame.tail is not guaranteed unless the table is sorted (using an ‘ORDER BY’ clause) or a column is declared as index for the IdaDataFrame (parameter/attribute indexer).

IdaDataFrame also implements most attributes that are available in a pandas DataFrame, here is an example of getting the _shape_ of the data frame (rows, columns):

In [10]:
idadf.shape

(127984, 8)

In [11]:
idadf.columns

Index(['DAY_KEY', 'ORGANIZATION_KEY', 'POSITION_KEY', 'EMPLOYEE_KEY',
       'EXPENSE_TYPE_KEY', 'ACCOUNT_KEY', 'EXPENSE_UNIT_QUANTITY',
       'EXPENSE_TOTAL'],
      dtype='object')

Several standard statistics functions from the pandas interface are also available for IdaDataFrame.  You can use the __TAB__ key after the `.` to see the methods and attributes available in an object in a pulldown menu. 

For example, let us calculate various summary statistics for the data set by using the `describe` method for the IdaDataFrame instance:

In [12]:
idadf.describe()

,DAY_KEY,ORGANIZATION_KEY,POSITION_KEY,EMPLOYEE_KEY,EXPENSE_TYPE_KEY,ACCOUNT_KEY,EXPENSE_UNIT_QUANTITY,EXPENSE_TOTAL
count,1.279840e+05,127984.000000,127984.000000,127984.000000,127984.000000,127984.000000,127984.000000,127984.000000
mean,2.011514e+07,11157.820524,43627.441797,4489.672811,2120.315289,8052.091636,31.291244,1318.107960
std,1.036554e+04,31.272648,12.175158,298.987628,9.386336,2.532779,57.717638,2078.720318
min,2.010013e+07,11101.000000,43601.000000,4001.000000,2101.000000,8049.000000,-15.000000,-658.010000
25%,2.011013e+07,11131.000000,43617.000000,4216.000000,2120.000000,8050.000000,0.080000,211.280000
50%,2.011123e+07,11166.000000,43630.000000,4480.000000,2122.000000,8052.000000,0.110000,438.045000
75%,2.012103e+07,11182.000000,43637.000000,4763.000000,2124.000000,8054.000000,16.250000,1598.345000
max,2.013073e+07,11204.000000,43656.000000,4972.000000,2137.000000,8056.000000,172.500000,28776.920000

__Note__: It is possible to subset the rows of an IdaDataFrame by accessing the IdaDataFrame with a slice object. You can also use the IdaDataFrame.loc attribute, which contains an ibmdbpy.Loc object. However, the row selection might be inaccurate if the current IdaDataFrame is not sorted or does not contain an indexer. This is due to the fact that dashDB stores the data across several nodes if available. Moreover, because dashDB is a column oriented database, row numbers are undefined:

In [13]:
idadf_new = idadf[0:9] # Select the first 10 rows
idadf_new.head(10)

/usr/local/src/conda3_runtime.v11/4.1.1/lib/python3.5/site-packages/ibmdbpy/indexing.py:118: UserWarning: Row order is not guaranteed if no indexer was given and the dataset was not sorted
  " was given and the dataset was not sorted")

,DAY_KEY,ORGANIZATION_KEY,POSITION_KEY,EMPLOYEE_KEY,EXPENSE_TYPE_KEY,ACCOUNT_KEY,EXPENSE_UNIT_QUANTITY,EXPENSE_TOTAL
0,20130630,11117,43620,4454,2120,8052,0.08,156.34
1,20130630,11117,43620,4454,2133,8050,15.00,2000.00
2,20130630,11117,43620,4454,2124,8056,0.03,58.63
3,20130630,11117,43620,4454,2122,8054,0.11,214.97
4,20130731,11117,43620,4454,2101,8049,150.00,1692.31
5,20130731,11117,43620,4454,2137,8050,7.50,500.00
6,20130731,11117,43620,4454,2124,8056,0.03,55.85
7,20130731,11117,43620,4454,2122,8054,0.11,204.77
8,20130731,11117,43620,4454,2120,8052,0.08,148.92
9,20130731,11117,43620,4454,2104,8050,15.00,169.23

## Use SQL
We can also use SQL to get the top 10.

In [14]:
top_10_df = idadb.ida_query('SELECT * FROM GOSALESDW.EMP_EXPENSE_FACT LIMIT 10')
top_10_df

,DAY_KEY,ORGANIZATION_KEY,POSITION_KEY,EMPLOYEE_KEY,EXPENSE_TYPE_KEY,ACCOUNT_KEY,EXPENSE_UNIT_QUANTITY,EXPENSE_TOTAL
0,20100131,11101,43639,4001,2120,8052,0.080,513.35
1,20100131,11101,43639,4001,2122,8054,0.110,705.86
2,20100131,11101,43639,4001,2124,8056,0.030,192.51
3,20100131,11101,43639,4001,2130,8050,0.005,2291.88
4,20100131,11101,43639,4001,2131,8049,165.000,4125.00
5,20100131,11101,43639,4001,2133,8050,15.000,2000.00
6,20100131,11101,43639,4001,2137,8050,7.500,500.00
7,20100228,11101,43639,4001,2120,8052,0.080,411.03
8,20100228,11101,43639,4001,2122,8054,0.110,565.16
9,20100228,11101,43639,4001,2124,8056,0.030,154.14

Find the top 10 employees (by id) by the number of transactions in the `GOSALESDW.EMP_EXPENSE_FACT` table.

In [15]:
idadb.ida_query('SELECT EMPLOYEE_KEY, COUNT(*) AS COUNT FROM GOSALESDW.EMP_EXPENSE_FACT GROUP BY EMPLOYEE_KEY ORDER BY COUNT DESC LIMIT 10')

   EMPLOYEE_KEY  COUNT
0          4112  263.0
1          4134  263.0
2          4135  261.0
3          4019  260.0
4          4368  260.0
5          4053  260.0
6          4016  260.0
7          4129  259.0
8          4480  259.0
9          4020  258.0

## Explore the trafficking data
__Time to apply what you've learned!__

Complete the tasks that are commented in the code blocks.  If you get stuck, check out the hints.  If you're still stuck, read the solution.  If you have any questions, feel free to ask.

In [17]:
# Create a variable called `trafficking_table` and set it to the name of the trafficking table in your dashDB instance, for example:
# trafficking_table = 'DASH1234.FEMALE_TRAFFICKING'

trafficking_table = '{}.FEMALE_HUMAN_TRAFFICKING'.format(credentials_1['username']).upper()

idadb.exists_table_or_view(trafficking_table)

# The output of this block should be:
# True

True

<div class="panel-group" id="accordion-10">
  <div class="panel panel-default">
    <div class="panel-heading">
      <h4 class="panel-title"><a data-toggle="collapse" data-parent="#accordion-10" href="#collapse1-10">Hint 1</a></h4>
    </div>
    <div id="collapse1-10" class="panel-collapse collapse">
      <div class="panel-body">
      
The table schema and name can be found [here](#Use-a-dataframe-to-read-and-manipulate-tables).
      
      </div>
    </div>
  </div>
</div>

In [18]:
# Create an IdaDataFrame called trafficking_df with the trafficking data and determine the shape of the table using the shape atribute of the trafficking_df instance

trafficking_df = IdaDataFrame(idadb, trafficking_table)

print(trafficking_df.shape)
trafficking_df.dtypes

(1085, 28)

                                TYPENAME
COLUMN_0                        SMALLINT
VETTING_LEVEL                   SMALLINT
DESCRIPTION                      VARCHAR
VETTING_LEVEL_PREDICTION        SMALLINT
ALGORITHM_NAME                   VARCHAR
ALT_NAME                         VARCHAR
GENDER                           VARCHAR
BIRTH_DATE                          DATE
BIRTH_COUNTRY                    VARCHAR
BIRTH_COUNTRY_CODE               VARCHAR
OCCUPATION                       VARCHAR
ALT_ADDRESS                      VARCHAR
ALT_SSN                          VARCHAR
ALT_PASSPORT_NUMBER              INTEGER
PASSPORT_COUNTRY                 VARCHAR
PASSPORT_COUNTRY_CODE            VARCHAR
COUNTRIES_VISITED                VARCHAR
COUNTRIES_VISITED_COUNT         SMALLINT
ARRIVAL_AIRPORT_COUNTRY_CODE     VARCHAR
ARRIVAL_AIRPORT_IATA             VARCHAR
ARRIVAL_AIRPORT_MUNICIPALITY     VARCHAR
ARRIVAL_AIRPORT_REGION           VARCHAR
DEPARTURE_AIRPORT_COUNTRY_CODE   VARCHAR
DEPARTURE_AIRPORT_IATA           VARCHAR
DEPARTURE_AIRPORT_MUNICIPALITY   VARCHAR
DEPARTURE_AIRPORT_REGION         VARCHAR
UUID                             VARCHAR
AGE                             SMALLINT

<div class="panel-group" id="accordion-11">
  <div class="panel panel-default">
    <div class="panel-heading">
      <h4 class="panel-title"><a data-toggle="collapse" data-parent="#accordion-11" href="#collapse1-11">Hint 1</a></h4>
    </div>
    <div id="collapse1-11" class="panel-collapse collapse">
      <div class="panel-body">
      
It's similar to the code:
<pre>
idadf = IdaDataFrame(idadb, 'GOSALESDW.EMP_EXPENSE_FACT')
</pre>
      
      </div>
    </div>
  </div>
  <div class="panel panel-default">
    <div class="panel-heading">
      <h4 class="panel-title"><a data-toggle="collapse" data-parent="#accordion-11" href="#collapse2-11">Solution</a></h4>
    </div>
    <div id="collapse2-11" class="panel-collapse collapse">
      <div class="panel-body">
<pre>
trafficking_df = IdaDataFrame(idadb, trafficking_table)
</pre>
      </div>
    </div>
  </div>
</div>

In [19]:
# Show the top 5 records from the table using a method of the IdaDataFrame or alternatively via a SQL query using the ida_query method of the idadb instance

trafficking_df.head()

,COLUMN_0,VETTING_LEVEL,DESCRIPTION,VETTING_LEVEL_PREDICTION,ALGORITHM_NAME,ALT_NAME,GENDER,BIRTH_DATE,BIRTH_COUNTRY,BIRTH_COUNTRY_CODE,...,ARRIVAL_AIRPORT_COUNTRY_CODE,ARRIVAL_AIRPORT_IATA,ARRIVAL_AIRPORT_MUNICIPALITY,ARRIVAL_AIRPORT_REGION,DEPARTURE_AIRPORT_COUNTRY_CODE,DEPARTURE_AIRPORT_IATA,DEPARTURE_AIRPORT_MUNICIPALITY,DEPARTURE_AIRPORT_REGION,UUID,AGE
0,1,100,NA,30,DECISION_TREE,Kathleen Bailey,F,1985-11-27,Ghana,GH,...,US,BMI,Bloomington/Normal,US-IL,AE,AUH,Abu Dhabi,AE-AZ,81d28245-a6d4-40e3-bac0-df61cc6625ce,31
1,2,30,NA,30,DECISION_TREE,Kelly Robbins,F,1971-01-17,Pakistan,PK,...,US,CLE,Cleveland,US-OH,UA,KBP,Kiev,UA-32,b4d817b3-2154-4351-b0e3-bcd736a76bf5,46
2,3,100,NA,30,DECISION_TREE,Linda Stewart,F,1997-04-15,Ghana,GH,...,US,TPA,Tampa,US-FL,RU,KJA,Krasnoyarsk,RU-KYA,a52a6477-1f5e-4b09-a5e3-f76333a7eb10,19
3,4,100,NA,30,DECISION_TREE,Stacey Courtney Gonzalez,F,1984-03-27,Ghana,GH,...,US,TOL,Toledo,US-OH,RU,AER,Sochi,RU-KDA,5fcbbf15-8268-4306-ac26-406c2faae251,32
4,5,30,NA,30,DECISION_TREE,Erika Patie Fowler,F,1998-06-18,Ghana,GH,...,US,FWA,Fort Wayne,US-IN,IE,ORK,Cork,IE-C,6d1fe59a-6828-4bc5-9ded-2194aa238461,18

<div class="panel-group" id="accordion-12">
  <div class="panel panel-default">
    <div class="panel-heading">
      <h4 class="panel-title"><a data-toggle="collapse" data-parent="#accordion-12" href="#collapse1-12">Hint 1</a></h4>
    </div>
    <div id="collapse1-12" class="panel-collapse collapse">
      <div class="panel-body">
      
Heads or tails?
      
      </div>
    </div>
  </div>
  <div class="panel panel-default">
    <div class="panel-heading">
      <h4 class="panel-title"><a data-toggle="collapse" data-parent="#accordion-12" href="#collapse2-12">Solution 1</a></h4>
    </div>
    <div id="collapse2-12" class="panel-collapse collapse">
      <div class="panel-body">
      Heads!
<pre>
trafficking_df.head()
</pre> 
      </div>
    </div>
  </div>
  <div class="panel panel-default">
    <div class="panel-heading">
      <h4 class="panel-title"><a data-toggle="collapse" data-parent="#accordion-12" href="#collapse3-12">Solution 2</a></h4>
    </div>
    <div id="collapse3-12" class="panel-collapse collapse">
      <div class="panel-body">
      SQL can work as well!  __Note__: The `+` operator used here is a way to concatenate strings in Python.
<pre>
idadb.ida_query('SELECT * FROM ' + trafficking_table + ' LIMIT 10')
</pre>
      </div>
    </div>
  </div>
</div>

In [20]:
# Query the trafficking table so that we get the vetting_level and the number of times that vetting_level appears in the trafficking table, ordered by the vetting_level

idadb.ida_query('SELECT VETTING_LEVEL, COUNT(*) AS COUNT FROM ' + trafficking_table + ' GROUP BY VETTING_LEVEL ORDER BY VETTING_LEVEL')

   VETTING_LEVEL  COUNT
0             10   42.0
1             20   40.0
2             30   96.0
3            100  907.0


<div class="panel-group" id="accordion-13">
  <div class="panel panel-default">
    <div class="panel-heading">
      <h4 class="panel-title"><a data-toggle="collapse" data-parent="#accordion-13" href="#collapse1-13">Hint 1</a></h4>
    </div>
    <div id="collapse1-13" class="panel-collapse collapse">
      <div class="panel-body">
      
It is similar to:

<pre>
idadb.ida_query('SELECT EMPLOYEE_KEY, COUNT(*) AS COUNT FROM GOSALESDW.EMP_EXPENSE_FACT GROUP BY EMPLOYEE_KEY ORDER BY COUNT DESC LIMIT 10')
</pre>
      
      </div>
    </div>
  </div>
  <div class="panel panel-default">
    <div class="panel-heading">
      <h4 class="panel-title"><a data-toggle="collapse" data-parent="#accordion-13" href="#collapse2-13">Hint 2</a></h4>
    </div>
    <div id="collapse2-13" class="panel-collapse collapse">
      <div class="panel-body">
      
The SQL query is:

<pre>
'SELECT VETTING_LEVEL, COUNT(*) AS COUNT FROM ' + trafficking_table + ' GROUP BY VETTING_LEVEL ORDER BY VETTING_LEVEL'
</pre>
      
      </div>
    </div>
  </div>
  <div class="panel panel-default">
    <div class="panel-heading">
      <h4 class="panel-title"><a data-toggle="collapse" data-parent="#accordion-13" href="#collapse3-13">Solution</a></h4>
    </div>
    <div id="collapse3-13" class="panel-collapse collapse">
      <div class="panel-body">
      
<pre>
idadb.ida_query('SELECT VETTING_LEVEL, COUNT(*) AS COUNT FROM ' + trafficking_table + ' GROUP BY VETTING_LEVEL ORDER BY VETTING_LEVEL')
</pre>

      </div>
    </div>
  </div>
</div>

## Close the database connection

To ensure expected behaviors, IdaDataBase instances need to be closed.

__Note__: Closing the *IdaDataBase* is equivalent to closing the connection: once the connection is closed, it is no longer possible to use the *IdaDataBase* instance and any *IdaDataFrame* instances that were opened on this connection.

In [ ]:
idadb.close()

## Summary

This notebook demonstrated how to establish a JDBC connection to a dashDB (or DB2) database from Python, work with data frames and explore the data using SQL and data frame object attributes and methods.

## Take it farther
### Free courses on <a href="https://bigdatauniversity.com/courses/?utm_source=tutorial-dashdb-python&utm_medium=github&utm_campaign=bdu/" rel="noopener noreferrer" target="_blank">Big Data University</a>: <a href="https://bigdatauniversity.com/courses/?utm_source=tutorial-dashdb-python&utm_medium=github&utm_campaign=bdu" rel="noopener noreferrer" target="_blank"><img src = "https://ibm.box.com/shared/static/xomeu7dacwufkoawbg3owc8wzuezltn6.png" width=600px> </a>